Public Attributes | List of all members
API_LocalCoordsType Struct Reference
Element Manager
Texture applying parameters. This structure is used in API_LocalCoordsData. More...
#include <APIdefs_Elements.h>
 Public Attributes
 API_Wrapping  | wrapping
Texturing method.
 API_Coord3D  | c0
The interpretation is dependent on the wrapping member.
 API_Coord3D  | c1
The interpretation is dependent on the wrapping member.
 API_Coord3D  | c2
The interpretation is dependent on the wrapping member.
 API_Coord3D  | c3
The interpretation is dependent on the wrapping member.
Detailed Description
Texture applying parameters. This structure is used in API_LocalCoordsData.
Remarks
See ACAPI_Element_GetMemo to find out which element type needs/provides which information in the memo.